[
  {
    "Version": "1.0.6.10",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Project owners can now add others users as owners on a project.",
        "VersionNumber": "1.0.6.10"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": [
      "For the beta users who had two Dashboard plugin instances in their Paretext menu, the new installer will correct that issue. However, depending on the menu item you previously selected, you may end up with Paratext complaining that the plugin can no longer be found. Just delete that window and then use the menus to open a new instance of the plugin.",
      "If the user needs to change the project that Paratex is connected to, in Paratext, they must first close any existing instances of the Dashboard Plugin.  Then open a new instance from the project they want to connect to.  Then finally, restart both Paratext and Dashboard",
      "Not everything is localized.",
      "There is a display issue with the Hebrew text where characters sometimes are out of order that is being worked on.",
      "In the EnhancedView mouse hover on the MACULA tokens, currently only shows the pronominal references for the OT. NT pronominal references will be coming in a future release.",
      "There is a Paratext bug for project types outside the normal set. If you try to load up a new Paratext Corpus and the list of projects is blank, this is a good indicator that this bug is affecting you.  Please contact Clear and we can help diagnose which project is the problem project type.",
      "Canceling parallelization midway through doesn’t delete the arrow.  Trying to delete the arrow itself will display an error message."
    ]
  },
  {
    "Version": "1.0.6.9",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Sometimes initializing a project with Collab caused an issue.",
        "VersionNumber": "1.0.6.9"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.6.8",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Clicking on and then off of the ClearDashboard plugin window in Paratext will no longer close the plugin connection.",
        "VersionNumber": "1.0.6.8"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.6.7",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Collaboration on projects is going into QA Testing on 6/5/2023.  This includes hosting our own private GitLab server for end user repositories.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 0,
        "Note": "Collaboration Manager to automatically add other users to your project, controlled by the repository owner.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 0,
        "Note": "Collaboration creation of new user on GitLab server along with email validation.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 0,
        "Note": "Verse-by-Verse display option for TextCollections",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 0,
        "Note": "BackTranslation text has been added to the Verse References dialog of the Pins window and some columns in the Pins tab have been combined.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 0,
        "Note": "A link to cleardashboard.org where users can watch instructional videos",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 3,
        "Note": "Additional end user metrics flushing and delay on exit to avoid missing data push to server.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 3,
        "Note": "Aqua endpoint has been updated and now will work again.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 3,
        "Note": "Fixes to parallel creation steps that better address USFM errors from Paratext",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 3,
        "Note": "The Pins panel has many minor UI changes, including displaying a verse’s back translation if available.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 2,
        "Note": "Tokens now Copy/Paste in original sentence order",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 2,
        "Note": "Removal of unused Xceed licensing toolset",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 2,
        "Note": "Alignment clear selection after join/unjoin operations",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - New user licensing bug",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Joining/Unjoining words in the Enhanced view no longer causes token duplication",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Exiting out of dialog during parallelization now removes arrow from Design Surface",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Text Collections bug where Cyrillic text was not being displayed correctly has been resolved by ensuring that end users have the Noto Serif font on their systems.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Users are now unable to have the same project open in two instances of dashboard at the same time",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resizing the application window now saves between sessions.",
        "VersionNumber": "1.0.6.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - ClearDashboard no longer freezes when starting it up for the first time after installation.",
        "VersionNumber": "1.0.6.7"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.5.8",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Addressed an issue where Licenses weren’t able to decrypt for new users.",
        "VersionNumber": "1.0.5.8"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.5.7",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Extra enhanced view tabs are no longer deleted upon closing and reopening the application.",
        "VersionNumber": "1.0.5.7"
      },
      {
        "NoteType": 2,
        "Note": "Now not able able to select books in tokenization dialog until USFM has finished being scanned for errors",
        "VersionNumber": "1.0.5.7"
      },
      {
        "NoteType": 1,
        "Note": "Fix - The current ClearDashboard project name now appears at the top of the application when a new project is created",
        "VersionNumber": "1.0.5.7"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.5.6",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 2,
        "Note": "Darkened text collection highlight color",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Explanatory text for Latin Word Tokenizer option saying that it is the “most common”",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Update database button to reset verse mappings to default versification",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 3,
        "Note": "Deleting either a Project Design Surface node or parallel corpus line will also remove any references from the Enhanced Views",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "“Create New Interlinear” menu item functionality added off of the right click menu of a connector line.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "“Create New Alignment” menu item functionality",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Ability to delete individual alignments and interlinears from the Project Design Surface’s right click context menus.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Ability to view a corpus in a database even if the user’s doesn’t have access to that corpus in Paratext",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Menu item to Help section of menu to pull up documentation",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Right click on a token and filter Pins by Key Terms and use radio buttons to filter Pins by XmlSource in Pins Pane",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "Notes now updated when a tokenized Text corpus is updated",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 0,
        "Note": "In an alignment view, unaligned words are colored grey while aligned words are colored black",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Notes on composite tokens can now be passed to Paratext",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Proper Fonts are now displayed in Marble and Lexicon dialog.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Removed Hebrew chapter tags from USFM to prevent them from appearing as text in a translation",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "A project now will render all the versification mappings for the entire Bible instead of only those books that were imported.  This is being done to avoid issues later on if the user decides to import additional books that were not included in the first import.  Old databases built under the original format will now display a button on the project picking window that will ask if the user wants to update to the new versification format.  Doing this will rebuild the entire versification mappings throughout the Dashboard process.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "A project can now no longer be open in multiple instances of Dashboard at the same time",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "Resources in the Project Design Surface are now colored as green instead of blue as projects",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "Dashboard will now show a disconnect and play a sound when the plugin is closed in Paratext.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "The default percentage of the lower dock windows has been raised up to better accommodate a larger view.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "EnhancedViews can now no longer be deleted while loading",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "The VC\u002B\u002B runtime no longer installs every time ClearDashboard is installed",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "The Lower Panes are now taller",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "Notes Pane UI",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "Made Text Collections navigation bar sticky and smaller",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 2,
        "Note": "The verse mapping between two corpora has been completely rewritten to provide for more text coverage and provide for expected performance gains.",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 3,
        "Note": "Note replies UI",
        "VersionNumber": "1.0.5.6"
      },
      {
        "NoteType": 3,
        "Note": "Many small quality of life changes to the world clock",
        "VersionNumber": "1.0.5.6"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.4.1",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Solved issue of Update link not appearing for full release",
        "VersionNumber": "1.0.4.1"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.4.0",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Solved issue where all corpora were set to original versification",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Solved bug regarding not being able to add a label to a note sometimes",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 2,
        "Note": "Disabled Aqua on install and added menu item that allows enabling and disabling of aqua",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 2,
        "Note": "removed new alignment/interlinear menu options",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 3,
        "Note": "Dashboard_Instructions.pdf",
        "VersionNumber": "1.0.4.0"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.3.2",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Ability for notes to be associated with composite tokens",
        "VersionNumber": "1.0.3.2"
      },
      {
        "NoteType": 0,
        "Note": "A lot more things have been localized",
        "VersionNumber": "1.0.3.2"
      },
      {
        "NoteType": 0,
        "Note": "Added IsSymmeterized to AlignmentSet database model",
        "VersionNumber": "1.0.3.2"
      },
      {
        "NoteType": 2,
        "Note": "AQuA is now hidden in the settings menu and users must restart the application to enable/disable it",
        "VersionNumber": "1.0.3.2"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.2.0",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Hmm, IBM4, and non-symmetrized are now alignment options",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - right-clicking composite tokens now updates selection after joining/unjoining",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Hebrew Vowels are no longer misplaced",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Setting language in ProjectPicker now persists to MainView",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Opening Dashboard with Paratext on but the Dashboard Plugin off results in the proper text displayed on the Dashboard startup screen",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - The tokenization queue now properly reacts when a corpus is deleted or canceled",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Visual and scrolling issues in the General Information part of the Marble tab have been fixed",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - The notes indicator did not go away on works if they were not highlighted while the note was being removed",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Adding back a corpus while it was also being deleted caused an error.",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Text is now copyable out of the Background tasks window",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 2,
        "Note": "Textboxes and buttons in the alignment dialog will be disabled while alignments are running",
        "VersionNumber": "1.0.2.0"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.1.0",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Notes list tab that allows users to see and search through all their notes in ClearDashboard",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 0,
        "Note": "Heatmap to AQuA",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 0,
        "Note": "Experimental alignment triangulation feature",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 3,
        "Note": "ReleaseNotes window is now faster to load and can scrollable with the mouse wheel",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resolved issue where changing Dashboard language to simplified Chinese would freeze everything",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resolved potential issue with deleting incorrect alignments",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resolved issue with alignment highlighting not appearing",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix -  Right clicking on a composite token after joining produced an error",
        "VersionNumber": "1.0.1.0"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  },
  {
    "Version": "1.0.0.0",
    "VersionType": 0,
    "ReleaseDate": "7/17/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Experimental AQUA interfaces have been added. This is very much a work-in-progress experimentation and will be refined as the project progresses.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 0,
        "Note": "Experimental alignment editing and deleting functionality has been added to this release. When there is an alignment between a source composite token and a target token in another verse, highlighting the tokens only works if you shift-hover over the target token in the other verse. To create an alignment, click on the source token (composite or regular), then shift-click on the target token. You will need to shift-hover to see the newly added alignment. To delete an alignment, shift hover to find the alignment. You can delete the alignment form either the source or target token.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 0,
        "Note": "New dialog for interlinear changes where lexemes can be added to translations.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 0,
        "Note": "shortcut to open list of projects with Ctrl \u002B O",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 2,
        "Note": "added mouse wheel scrolling for elements in the Marble pane",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 2,
        "Note": "Allow corpora to be deleted when the background status is completed yet still in the background status window",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - On the interlinear approval/modification dialog, clicking on the “Apply Translation” button now will work at properly approving the selected word even if no changes have been made.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Addressed copy issues in Biblical Terms pane",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - addressed issues in TextCollections including RTL languages and missing TND content",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Some texts in TextCollections weren’t being highlighted",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 4,
        "Note": "Notes list with filtering and a way to quickly mark notes ‘resolved’ will be released in a subsequent version.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 4,
        "Note": "Notes sharing will be released in a subsequent version.",
        "VersionNumber": "1.0.0.0"
      }
    ],
    "DownloadLink": "https://cleardashboard.org/",
    "KnownIssues": []
  }
]