[
  {
    "Version": "1.0.4.0",
    "VersionType": 0,
    "ReleaseDate": "3/28/2023",
    "ReleaseNotes": [
      {
        "NoteType": 1,
        "Note": "Fix - Solved issue where all corpora were set to original versification",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Solved bug regarding not being able to add a label to a note sometimes",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 2,
        "Note": "Disabled Aqua on install and added menu item that allows enabling and disabling of aqua",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 2,
        "Note": "removed new alignment/interlinear menu options",
        "VersionNumber": "1.0.4.0"
      },
      {
        "NoteType": 3,
        "Note": "Dashboard_Instructions.pdf",
        "VersionNumber": "1.0.4.0"
      }
    ],
    "DownloadLink": "https://drive.google.com/drive/folders/1x4-4vjZS4AM6HNehp6XX66TZP68Q68f5",
    "KnownIssues": [
      "For the beta users who had two Dashboard plugin instances in their Paretext menu, the new installer will correct that issue. However, depending on the menu item you previously selected, you may end up with Paratext complaining that the plugin can no longer be found. Just delete that window and then use the menus to open a new instance of the plugin.",
      "If the user needs to change the project that Paratex is connected to, in Paratext, they must first close any existing instances of the Dashboard Plugin.  Then open a new instance from the project they want to connect to.  Then finally, restart both Paratext and Dashboard",
      "Not everything is localized.",
      "There is a display issue with the Hebrew text where characters sometimes are out of order that is being worked on.",
      "In the EnhancedView mouse hover on the MACULA tokens, currently only shows the pronominal references for the OT. NT pronominal references will be coming in a future release.",
      "There is a Paratext bug for project types outside the normal set. If you try to load up a new Paratext Corpus and the list of projects is blank, this is a good indicator that this bug is affecting you.  Please contact Clear and we can help diagnose which project is the problem project type."
    ]
  },
  {
    "Version": "1.0.3.2",
    "VersionType": 0,
    "ReleaseDate": "3/28/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Ability for notes to be associated with composite tokens",
        "VersionNumber": "1.0.3.2"
      },
      {
        "NoteType": 0,
        "Note": "A lot more things have been localized",
        "VersionNumber": "1.0.3.2"
      },
      {
        "NoteType": 0,
        "Note": "Added IsSymmeterized to AlignmentSet database model",
        "VersionNumber": "1.0.3.2"
      },
      {
        "NoteType": 2,
        "Note": "AQuA is now hidden in the settings menu and users must restart the application to enable/disable it",
        "VersionNumber": "1.0.3.2"
      }
    ],
    "DownloadLink": "https://drive.google.com/drive/folders/1x4-4vjZS4AM6HNehp6XX66TZP68Q68f5",
    "KnownIssues": []
  },
  {
    "Version": "1.0.2.0",
    "VersionType": 0,
    "ReleaseDate": "3/28/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Hmm, IBM4, and non-symmetrized are now alignment options",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - right-clicking composite tokens now updates selection after joining/unjoining",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Hebrew Vowels are no longer misplaced",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Setting language in ProjectPicker now persists to MainView",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Opening Dashboard with Paratext on but the Dashboard Plugin off results in the proper text displayed on the Dashboard startup screen",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - The tokenization queue now properly reacts when a corpus is deleted or canceled",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Visual and scrolling issues in the General Information part of the Marble tab have been fixed",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - The notes indicator did not go away on works if they were not highlighted while the note was being removed",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Adding back a corpus while it was also being deleted caused an error.",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Text is now copyable out of the Background tasks window",
        "VersionNumber": "1.0.2.0"
      },
      {
        "NoteType": 2,
        "Note": "Textboxes and buttons in the alignment dialog will be disabled while alignments are running",
        "VersionNumber": "1.0.2.0"
      }
    ],
    "DownloadLink": "https://drive.google.com/drive/folders/1x4-4vjZS4AM6HNehp6XX66TZP68Q68f5",
    "KnownIssues": []
  },
  {
    "Version": "1.0.1.0",
    "VersionType": 0,
    "ReleaseDate": "3/28/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Notes list tab that allows users to see and search through all their notes in ClearDashboard",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 0,
        "Note": "Heatmap to AQuA",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 0,
        "Note": "Experimental alignment triangulation feature",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 3,
        "Note": "ReleaseNotes window is now faster to load and can scrollable with the mouse wheel",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resolved issue where changing Dashboard language to simplified Chinese would freeze everything",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resolved potential issue with deleting incorrect alignments",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Resolved issue with alignment highlighting not appearing",
        "VersionNumber": "1.0.1.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix -  Right clicking on a composite token after joining produced an error",
        "VersionNumber": "1.0.1.0"
      }
    ],
    "DownloadLink": "https://drive.google.com/drive/folders/1x4-4vjZS4AM6HNehp6XX66TZP68Q68f5",
    "KnownIssues": []
  },
  {
    "Version": "1.0.0.0",
    "VersionType": 0,
    "ReleaseDate": "3/28/2023",
    "ReleaseNotes": [
      {
        "NoteType": 0,
        "Note": "Experimental AQUA interfaces have been added. This is very much a work-in-progress experimentation and will be refined as the project progresses.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 0,
        "Note": "Experimental alignment editing and deleting functionality has been added to this release. When there is an alignment between a source composite token and a target token in another verse, highlighting the tokens only works if you shift-hover over the target token in the other verse. To create an alignment, click on the source token (composite or regular), then shift-click on the target token. You will need to shift-hover to see the newly added alignment. To delete an alignment, shift hover to find the alignment. You can delete the alignment form either the source or target token.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 0,
        "Note": "New dialog for interlinear changes where lexemes can be added to translations.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 0,
        "Note": "shortcut to open list of projects with Ctrl \u002B O",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 2,
        "Note": "added mouse wheel scrolling for elements in the Marble pane",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 2,
        "Note": "Allow corpora to be deleted when the background status is completed yet still in the background status window",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - On the interlinear approval/modification dialog, clicking on the “Apply Translation” button now will work at properly approving the selected word even if no changes have been made.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Addressed copy issues in Biblical Terms pane",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - addressed issues in TextCollections including RTL languages and missing TND content",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 1,
        "Note": "Fix - Some texts in TextCollections weren’t being highlighted",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 4,
        "Note": "Notes list with filtering and a way to quickly mark notes ‘resolved’ will be released in a subsequent version.",
        "VersionNumber": "1.0.0.0"
      },
      {
        "NoteType": 4,
        "Note": "Notes sharing will be released in a subsequent version.",
        "VersionNumber": "1.0.0.0"
      }
    ],
    "DownloadLink": "https://drive.google.com/drive/folders/1x4-4vjZS4AM6HNehp6XX66TZP68Q68f5",
    "KnownIssues": []
  }
]